# Load csv file with pure Python

In [6]:
csv_content = []
with open("sample.csv") as f:
    for line in f:
        line_components = line.strip().split(",")
        csv_content.append(line_components)

In [7]:
csv_content

[['name', 'age', 'city', 'occupation', 'salary'],
 ['Alice Johnson', '28', 'New York', 'Software Engineer', '85000'],
 ['Bob Smith', '34', 'San Francisco', 'Data Scientist', '95000'],
 ['Carol Davis', '29', 'Boston', 'Product Manager', '75000'],
 ['David Wilson', '31', 'Seattle', 'UX Designer', '70000'],
 ['Eva Brown', '26', 'Austin', 'Marketing Specialist', '60000']]

# Pandas basics

In [8]:
import pandas as pd

In [9]:
csv_df = pd.read_csv("sample.csv")

In [10]:
csv_df

            name  age           city            occupation  salary
0  Alice Johnson   28       New York     Software Engineer   85000
1      Bob Smith   34  San Francisco        Data Scientist   95000
2    Carol Davis   29         Boston       Product Manager   75000
3   David Wilson   31        Seattle           UX Designer   70000
4      Eva Brown   26         Austin  Marketing Specialist   60000

In [11]:
csv_df['name']

0    Alice Johnson
1        Bob Smith
2      Carol Davis
3     David Wilson
4        Eva Brown
Name: name, dtype: object

In [13]:
csv_df['age']

0    28
1    34
2    29
3    31
4    26
Name: age, dtype: int64

# Other separators

In [33]:
pd.read_csv("sample_broken.csv")

,name,age,city,occupation,salary
Alice Johnson,28,New York,Software Engineer,Data Scientist,85000.0
Bob Smith,34,San Francisco,Data Scientist,95000,NaN
Davis,Carol,29,Boston,Product Manager,75000.0
David Wilson,31,Seattle,UX Designer,70000,NaN
Eva Brown,26,Austin,Marketing Specialist,60000,NaN

In [26]:
csv_df.to_csv("sample_pipe.csv", sep="|", index=None)

In [27]:
pd.read_csv("sample_pipe.csv")

                     name|age|city|occupation|salary
0  Alice Johnson|28|New York|Software Engineer|85000
1    Bob Smith|34|San Francisco|Data Scientist|95000
2        Carol Davis|29|Boston|Product Manager|75000
3          David Wilson|31|Seattle|UX Designer|70000
4     Eva Brown|26|Austin|Marketing Specialist|60000

In [28]:
pd.read_csv("sample_pipe.csv", sep="|")

            name  age           city            occupation  salary
0  Alice Johnson   28       New York     Software Engineer   85000
1      Bob Smith   34  San Francisco        Data Scientist   95000
2    Carol Davis   29         Boston       Product Manager   75000
3   David Wilson   31        Seattle           UX Designer   70000
4      Eva Brown   26         Austin  Marketing Specialist   60000

In [29]:
csv_df.to_csv("sample_t.tsv", sep='\t', index=None)

In [32]:
pd.read_csv("sample_t.tsv")

                 name\tage\tcity\toccupation\tsalary
0  Alice Johnson\t28\tNew York\tSoftware Engineer...
1  Bob Smith\t34\tSan Francisco\tData Scientist\t...
2    Carol Davis\t29\tBoston\tProduct Manager\t75000
3      David Wilson\t31\tSeattle\tUX Designer\t70000
4  Eva Brown\t26\tAustin\tMarketing Specialist\t6...

In [34]:
pd.read_csv("sample_t.tsv", sep="\t")

            name  age           city            occupation  salary
0  Alice Johnson   28       New York     Software Engineer   85000
1      Bob Smith   34  San Francisco        Data Scientist   95000
2    Carol Davis   29         Boston       Product Manager   75000
3   David Wilson   31        Seattle           UX Designer   70000
4      Eva Brown   26         Austin  Marketing Specialist   60000